Revit 2027 API
ParameterAccess.GetParameter(ElementId, ElementId) Method
 Retrieves the parameter value for the parameter on the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EvaluatedParameter GetParameter(
	ElementId elementId,
	ElementId parameterId
)
Public Function GetParameter (
	elementId As ElementId,
	parameterId As ElementId
) As EvaluatedParameter
public:
EvaluatedParameter^ GetParameter(
	ElementId^ elementId,
	ElementId^ parameterId
)
member GetParameter :
        elementId : ElementId *
        parameterId : ElementId -> EvaluatedParameter
Parameters
elementId ElementId
ElementId of the element whose parameter value is requested.
parameterId ElementId
 The id of the parameter to obtain.
Return Value
EvaluatedParameter
 The evaluated parameter value or a default object if no value exists.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterAccess Class
GetParameter Overload
Autodesk.Revit.DB Namespace